## Terraform Results for gradient-metal-gc`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.gradient_metal.module.container_registry_mirror.helm_release.docker_mirror will be created
  + resource "helm_release" "docker_mirror" {
      + atomic                     = false
      + chart                      = "docker-registry-mirror"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "docker-registry-mirror"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://t83714.github.io/docker-registry-mirror"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "1.10.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.gradient_metal.module.container_registry_mirror.kubernetes_namespace.docker_registry will be created
  + resource "kubernetes_namespace" "docker_registry" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "docker-registry"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.gradient_metal.module.container_registry_mirror.random_string.ha_shared_secret will be created
  + resource "random_string" "ha_shared_secret" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

  # module.gradient_metal.module.descheduler.helm_release.descheduler will be created
  + resource "helm_release" "descheduler" {
      + atomic                     = false
      + chart                      = "descheduler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "descheduler"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/descheduler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                kind: Deployment
                deschedulerPolicy:
                  strategies:
                    "RemoveFailedPods":
                      enabled: true
                      params:
                        failedPods:
                          reasons:
                          - "Evicted"
                          includingInitContainers: true
                        labelSelector:
                          matchExpressions:
                            - { key: "paperspace.com/deployment-id", operator: Exists }
                    "RemoveDuplicates":
                       enabled: true
                       params:
                         removeDuplicates:
                           excludeOwnerKinds:
                           - "ReplicaSet"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.26.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.gradient_metal.module.gradient_processing.data.kubernetes_service.traefik will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "traefik" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.gradient_metal.module.gradient_processing.helm_release.gradient_processing will be created
  + resource "helm_release" "gradient_processing" {
      + atomic                     = false
      + chart                      = "gradient-processing"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gradient-processing"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://infrastructure-public-chart-museum-repository.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "1.5.13"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "traefik.timeouts.forwarding.responseHeaderTimeout"
          + value = "10m"
        }

      + set_sensitive {
          + name  = "global.artifactsAccessKeyId"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "global.artifactsSecretAccessKey"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "secrets.amqpUri"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "secrets.clusterApikey"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "secrets.clusterAuthorizationToken"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name = "secrets.tlsCert"
        }
      + set_sensitive {
          + name = "secrets.tlsKey"
        }
      + set_sensitive {
          + name  = "traefik.acme.dnsProvider.name"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "traefik.ssl.defaultCert"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "traefik.ssl.defaultKey"
          + value = (sensitive value)
        }
    }

  # module.gradient_metal.module.gradient_processing.random_password.nats_token will be created
  + resource "random_password" "nats_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.gradient_metal.module.s3_external_ingress.kubernetes_endpoints.endpoints will be created
  + resource "kubernetes_endpoints" "endpoints" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "s3"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + subset {

          + port {
              + name     = "http"
              + port     = 8443
              + protocol = "TCP"
            }
        }
    }

  # module.gradient_metal.module.s3_external_ingress.kubernetes_ingress.ingress will be created
  + resource "kubernetes_ingress" "ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "traefik.ingress.kubernetes.io/custom-response-headers" = "Access-Control-Allow-Origin:https://console.paperspace.com||Access-Control-Allow-Methods:GET,PUT,POST,OPTIONS||Access-Control-Allow-Headers:*||Access-Control-Expose-Headers:Content-Length,Content-Range||Access-Control-Allow-Credentials:true"
            }
          + generation       = (known after apply)
          + name             = "s3"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "s3.gradient.mycompany.com"

              + http {
                  + path {
                      + path = "/"

                      + backend {
                          + service_name = "s3"
                          + service_port = "80"
                        }
                    }
                }
            }
        }
    }

  # module.gradient_metal.module.s3_external_ingress.kubernetes_service.service will be created
  + resource "kubernetes_service" "service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "s3"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + publish_not_ready_addresses = false
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "8443"
            }
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @paperspace-sean, Action: `pull_request`, Working Directory: `gradient-metal-gc`, Workflow: `pr`*